meshtastic/firmware/src/platform/stm32wl/architecture.h
#pragma once

#define ARCH_STM32WL
#define ARCH_STM32

//
// defaults for STM32WL architecture
//

#ifndef HAS_RADIO
#define HAS_RADIO 1
#endif
#ifndef HAS_TELEMETRY
#define HAS_TELEMETRY 1
#endif
#ifndef HAS_WIRE
#define HAS_WIRE 1
#endif
#ifndef HAS_LSE
#define HAS_LSE 0
#endif

// How long to wait for the LSE 32.768kHz crystal to lock before giving up on hardware RTC support.
// Override in a variant's variant.h if that board's crystal needs longer to stabilize.
#ifndef STM32WL_LSE_TIMEOUT_MS
#define STM32WL_LSE_TIMEOUT_MS 2000
#endif

// A variant that sets HAS_LSE must also define STM32WL_LSE_DRIVE - catch that mistake here, not as a confusing
// HAL compile error deep in main-stm32wl.cpp.
#if HAS_LSE && !defined(STM32WL_LSE_DRIVE)
#error                                                                                                                           \
    "HAS_LSE is set but STM32WL_LSE_DRIVE is not defined - set it in the variant's variant.h to one of RCC_LSEDRIVE_LOW/MEDIUMLOW/MEDIUMHIGH/HIGH"
#endif

#if HAS_LSE && !defined(HAS_CPU_SHUTDOWN)
#define HAS_CPU_SHUTDOWN 1
#elif HAS_CPU_SHUTDOWN && !HAS_LSE
#error "STM32WL: HAS_CPU_SHUTDOWN requires HAS_LSE (RTC wake path)"
#endif

// How long to wait for the LPUART1 kernel clock to be ready for switching to HSI16 before giving up.
#ifndef STM32WL_LPUART1_SWITCH_TIMEOUT_MS
#define STM32WL_LPUART1_SWITCH_TIMEOUT_MS 1000
#endif

#if defined(ENABLE_HWSERIALLP1)
// True once stm32wlSetup() has verified HSI16 is stable and routed to LPUART1.
bool stm32wlLpuartAvailable();
#endif

//
// set HW_VENDOR
//
#ifdef _VARIANT_WIOE5_
#define HW_VENDOR meshtastic_HardwareModel_WIO_E5
#elif defined(_VARIANT_RAK3172_)
#define HW_VENDOR meshtastic_HardwareModel_RAK3172
#else
#define HW_VENDOR meshtastic_HardwareModel_PRIVATE_HW
#endif

/* virtual pins */
#define SX126X_CS 1000
#define SX126X_DIO1 1001
#define SX126X_RESET 1003
#define SX126X_BUSY 1004

#if !defined(DEBUG_MUTE) && !defined(PIO_FRAMEWORK_ARDUINO_NANOLIB_FLOAT_PRINTF)
#error                                                                                                                           \
    "You MUST enable PIO_FRAMEWORK_ARDUINO_NANOLIB_FLOAT_PRINTF if debug prints are enabled. printf will print uninitialized garbage instead of floats."
#endif